
    &НаКлиенте
    Процедура СоздатьСписок(Команда)
     ДлительнаяОперация = НачатьВыполнениеНаСервере();
     ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
     ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
     ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    КонецПроцедуры

    &НаСервере
    Функция НачатьВыполнениеНаСервере()
     ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере", 
      Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
    КонецФункции
                      
    &НаКлиенте
    Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
     Если Результат = Неопределено Тогда
      Возврат;
  КонецЕсли;
     
   СписокРеализацийМассив = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
   ЗаполнитьСписокРеализаций(СписокРеализацийМассив);
     
КонецПроцедуры  

  	&НаКлиенте
	Процедура  ЗаполнитьСписокРеализаций(СписокРеализацийМассив);
		
		Объект.СписокРеализаций.Очистить(); 
				
		Для Каждого СписокРеализацияСтруктура Из СписокРеализацийМассив Цикл 
			
			НоваяСтрока = Объект.СписокРеализаций.Добавить();
			НоваяСтрока.Договор = СписокРеализацияСтруктура.Договор;       
			НоваяСтрока.Реализация = СписокРеализацияСтруктура.Реализация;
				
		КонецЦикла;
				
	КонецПроцедуры
	
		

  	
	 