#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыСведений.ВКМ_ГрафикиОтпусков.СоздатьНаборЗаписей();
	ЧислоСекундВСутках = 86400;
	
	Для Каждого СтрТЧ Из ОтпускаСотрудников Цикл 
		День = СтрТЧ.ДатаНачала;
		Пока День < СтрТЧ.ДатаОкончания + 1 Цикл
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.Дата = День;
			НоваяЗапись.Сотрудник = СтрТЧ.Сотрудник;
			НоваяЗапись.Значение = 1; 
			День = День + ЧислоСекундВСутках;
		КонецЦикла;
	КонецЦикла; 
	
	Набор.Записать(Ложь);
			
КонецПроцедуры

#КонецОбласти