

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВидРасчетаПремия = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
	ВидРасчетаНДФЛ = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		
	Для Каждого ТекСтрокаНачислениеПремии Из НачислениеПремии Цикл
		
	//Дополнительные начисления
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ВидРасчетаПремия ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаНачислениеПремии.Сотрудник;
		СуммаПремии = ТекСтрокаНачислениеПремии.СуммаПремии;
		Движение.Сумма = СуммаПремии;
		
	// удержания
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ВидРасчетаНДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаНачислениеПремии.Сотрудник;
		Движение.Сумма = СуммаПремии * 13 / 100;
		Движение.База = ВидРасчетаПремия; 
		
	//взаиморасчеты
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаНачислениеПремии.Сотрудник;
		Движение.Сумма = СуммаПремии * 87 / 100;
		
	КонецЦикла;
	
	
	 Движения.ВКМ_ДополнительныеНачисления.Записать();
	 Движения.ВКМ_Удержания.Записать();
	 Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

	КонецПроцедуры  



