#Область ОбработчикиСобытийФормы 

&НаКлиенте
 Процедура ПриОткрытии(Отказ)
	 
	 Адрес = ВладелецФормы.ПоместитьВоВременноеХранилищеНаСервере();
	 ОтпускаСотрудниковДанные = ПолучитьИзВременногоХранилища(Адрес);
	 
	 
	 Для Каждого Элемент Из ОтпускаСотрудниковДанные Цикл
		 
		 Точка = АнализОтпусков.УстановитьТочку(Элемент.Фамилия);
		 Серия = АнализОтпусков.УстановитьСерию("Отпуск");
		 ЗначениеДГ = АнализОтпусков.ПолучитьЗначение(Точка,Серия);
		 
		 Интервал = ЗначениеДГ.Добавить();
		 Интервал.Начало = Элемент.Начало;
		 Интервал.Конец = Элемент.Конец;
		 		 		 
	 КонецЦикла;
	 
			 
 КонецПроцедуры
#КонецОбласти
 
 
  