
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	// ВКМ{
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
			    		
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Покупатель
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Поставщик Тогда 
		
		Элементы.ВКМ_ДатаНачала.Видимость = Ложь;
		Объект.ВКМ_ДатаНачала = "";
		Элементы.ВКМ_ДатаОкончания.Видимость = Ложь;
		Объект.ВКМ_ДатаОкончания = "";
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		Объект.ВКМ_АбонентскаяПлата = "";
        Элементы.ВКМ_СтоимостьЧаса.Видимость = Ложь;  
		Объект.ВКМ_СтоимостьЧаса = "";
        	
	КонецЕсли;
	// }ВКМ
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ{
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала"; 
	НовыйЭлемент.Видимость = Ложь;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания"; 
	НовыйЭлемент.Видимость = Ложь;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата"; 
	НовыйЭлемент.Видимость = Ложь;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса"; 
	НовыйЭлемент.Видимость = Ложь;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 
			    		
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
		Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
		
	КонецЕсли
    // }ВКМ

КонецПроцедуры

